* Among Nurse

** Understanding the table

- iter(fix)/C shows the total # of iteration per choice point.
- #CS is the number of times createState is called.
- #L number of layers
- nbNode total number of nodes in MDD
- CS/N  number of calls to createState normalized by  number of MDD
  nodes.
- Choice-Rate: reduction rate in choice point w.r.t.   previous width.
- CS-Rate: reduction rate calls to createState  w.r.t. previous width
- CS/N-Rate: reduction rate in createState/Node w.r.t. previous width.

** Data
This is the best model (seqMDD3). Bi-directional.
- State takes 224 bytes
- Properties are still bytes
- States uses 172 properties

|   w | m | choice |   fail | #iter(fix)/C |      #CS | #L | time | nbNode |    #CS/#N | Choice-Rate | CS-Rate | CS/N-Rate |
|-----+---+--------+--------+--------------+----------+----+------+--------+-----------+-------------+---------+-----------|
|   1 | 3 | 375140 | 185287 |         1.55 | 12356839 | 40 | 18.1 |     40 | 308920.98 |             |         |           |
|   2 | 3 | 163392 |  79413 |          1.9 | 16358330 | 40 | 24.1 |     80 | 204479.13 |        2.30 |    0.76 |      1.51 |
|   4 | 3 |  52568 |  24001 |          2.8 | 13207178 | 40 | 18.8 |    160 |  82544.86 |        3.11 |    1.24 |      2.48 |
|   8 | 3 |  22274 |   8854 |          3.1 | 10269173 | 40 | 14.7 |    320 |  32091.17 |        2.36 |    1.29 |      2.57 |
|  16 | 3 |   8806 |   2120 |         3.27 |  7005305 | 40 | 10.1 |    640 |  10945.79 |        2.53 |    1.47 |      2.93 |
|  32 | 3 |   6456 |    945 |          3.1 |  6166040 | 40 |  9.0 |   1280 |   4817.22 |        1.36 |    1.14 |      2.27 |
|  64 | 3 |   5146 |    299 |         2.96 |  4999621 | 40 |  7.2 |   2560 |   1952.98 |        1.25 |    1.23 |      2.47 |
| 128 | 3 |   4738 |     86 |         2.88 |  4700471 | 40 |  7.3 |   5120 |    918.06 |        1.09 |    1.06 |      2.13 |
#+TBLFM: $9=$1*$7::$10=$6/$9;%0.2f
#+TBLFM: @3$11=@2$3/$3;%0.2f::@4$11=@3$3/$3;%0.2f::@5$11=@4$3/$3;%0.2f::@6$11=@5$3/$3;%0.2f::@7$11=@6$3/$3;%0.2f::@8$11=@7$3/$3;%0.2f::@9$11=@8$3/$3;%0.2f
#+TBLFM: @3$12=@2$6/$6;%0.2f::@4$12=@3$6/$6;%0.2f::@5$12=@4$6/$6;%0.2f::@6$12=@5$6/$6;%0.2f::@7$12=@6$6/$6;%0.2f::@8$12=@7$6/$6;%0.2f::@9$12=@8$6/$6;%0.2f
#+TBLFM: @3$13=@2$10/$10;%0.2f::@4$13=@3$10/$10;%0.2f::@5$13=@4$10/$10;%0.2f::@6$13=@5$10/$10;%0.2f::@7$13=@6$10/$10;%0.2f::@8$13=@7$10/$10;%0.2f::@9$13=@8$10/$10;%0.2f

This is a pure top-down model (no up information) 
- State takes 592 bytes
- Properties are all integers (fast)
- State uses 146 properties

|   w | m | choice |   fail | #iter(fix)/C |     #CS | #L | time | nbNode |    #CS/#N | Choice-Rate | CS-Rate | CS/N-Rate |
|-----+---+--------+--------+--------------+---------+----+------+--------+-----------+-------------+---------+-----------|
|   1 | 1 | 375140 | 185287 |      1.05137 | 4777581 | 40 |  5.0 |     40 | 119439.53 |             |         |           |
|   2 | 1 | 190120 |  92777 |      1.14861 | 7915365 | 40 |  6.7 |     80 |  98942.06 |        1.97 |    0.60 |      1.21 |
|   4 | 1 |  67080 |  31257 |       1.3823 | 7282379 | 40 |  6.1 |    160 |  45514.87 |        2.83 |    1.09 |      2.17 |
|   8 | 1 |  34506 |  14970 |      1.26905 | 5586608 | 40 |  4.9 |    320 |  17458.15 |        1.94 |    1.30 |      2.61 |
|  16 | 1 |  17046 |   6240 |      1.35193 | 4829054 | 40 |  4.2 |    640 |   7545.40 |        2.02 |    1.16 |      2.31 |
|  32 | 1 |  10404 |   2919 |      1.40677 | 3555647 | 40 |  3.1 |   1280 |   2777.85 |        1.64 |    1.36 |      2.72 |
|  64 | 1 |  13194 |   4314 |      1.32901 | 5962597 | 40 |  5.0 |   2560 |   2329.14 |        0.79 |    0.60 |      1.19 |
| 128 | 1 |   7888 |   1661 |      1.44929 | 3436506 | 40 |  3.6 |   5120 |    671.19 |        1.67 |    1.74 |      3.47 |
#+TBLFM: $9=$1*$7::$10=$6/$9;%0.2f
#+TBLFM: @3$11=@2$3/$3;%0.2f::@4$11=@3$3/$3;%0.2f::@5$11=@4$3/$3;%0.2f::@6$11=@5$3/$3;%0.2f::@7$11=@6$3/$3;%0.2f::@8$11=@7$3/$3;%0.2f::@9$11=@8$3/$3;%0.2f
#+TBLFM: @3$12=@2$6/$6;%0.2f::@4$12=@3$6/$6;%0.2f::@5$12=@4$6/$6;%0.2f::@6$12=@5$6/$6;%0.2f::@7$12=@6$6/$6;%0.2f::@8$12=@7$6/$6;%0.2f::@9$12=@8$6/$6;%0.2f
#+TBLFM: @3$13=@2$10/$10;%0.2f::@4$13=@3$10/$10;%0.2f::@5$13=@4$10/$10;%0.2f::@6$13=@5$10/$10;%0.2f::@7$13=@6$10/$10;%0.2f::@8$13=@7$10/$10;%0.2f::@9$13=@8$10/$10;%0.2f

** Analysis

A few observations on m3
- The number of choice points drops at a factor > 2 up to with 16,
  then it slows down
- The number of ~createState~ calls increases at first, despite the more
  than halving of the number of choice point. So that is a net loss
  (since ~createState~ is the most expensive operation at the moment)
- The number of ~createState~ per mdd node does drop at a rate > 2,
  except going from w=1 to w=2 where the drop is more modest (1.51)
- The CS-Rate starts below 1 (i.e.,  going w=1->2 has a net
  increase). That observation is even _worse_ with m=1 where the rate
  is 0.6.

Comparison to m1
- This hurts. The number of calls to ~createState~ is almost 3 times higher
  in m3 while at width=1, i.e.,  4.7M versus 12.3M. I can understand
  doubling, because of the up-pass. But the almost triple hurts. 
- The number of fixpoint iteration per choice explains the above. 1.05
  in m1 vs. 1.55 in m3. 

Lessons ?
- Sounds like bounding the number of fixpoint iterations is in order. 
- There are too many calls to create state at the onset with w=2. It's
  true for both m=1 and m=3. Recall that we start with an mdd of
  width=1 and use the post to do an initial round of splitting to
  bring it to the desired width. Maybe we should revisit that. This
  was motivated by the up-pass that was required to do any kind of
  initial filtering of arcs. 


** Refinement 

Ok, I merely bounded the number of iterations of fixpoint to 2.

|   w | m | choice |   fail | #iter(fix)/C |      #CS | #L | time | nbNode |    #CS/#N | Choice-Rate | CS-Rate | CS/N-Rate |
|-----+---+--------+--------+--------------+----------+----+------+--------+-----------+-------------+---------+-----------|
|   1 | 3 | 375140 | 185287 |         1.55 | 12356839 | 40 | 18.1 |     40 | 308920.98 |             |         |           |
|   2 | 3 | 177484 |  86459 |         0.71 | 12347491 | 40 | 17.2 |     80 | 154343.64 |        2.11 |    1.00 |      2.00 |
|   4 | 3 |  74582 |  35008 |         0.84 | 10226362 | 40 | 13.6 |    160 |  63914.76 |        2.38 |    1.21 |      2.41 |
|   8 | 3 |  32216 |  13825 |         0.96 |  7366953 | 40 |  9.9 |    320 |  23021.73 |        2.32 |    1.39 |      2.78 |
|  16 | 3 |  15210 |   5322 |         1.07 |  5413852 | 40 |  7.4 |    640 |   8459.14 |        2.12 |    1.36 |      2.72 |
|  32 | 3 |   8874 |   2154 |         1.26 |  4070803 | 40 |  5.9 |   1280 |   3180.31 |        1.71 |    1.33 |      2.66 |
|  64 | 3 |   5896 |    665 |         1.50 |  2986129 | 40 |  4.4 |   2560 |   1166.46 |        1.51 |    1.36 |      2.73 |
| 128 | 3 |   5432 |    433 |         1.56 |  3025268 | 40 |  5.2 |   5120 |    590.87 |        1.09 |    0.99 |      1.97 |
#+TBLFM: $9=$1*$7::$10=$6/$9;%0.2f
#+TBLFM: @3$11=@2$3/$3;%0.2f::@4$11=@3$3/$3;%0.2f::@5$11=@4$3/$3;%0.2f::@6$11=@5$3/$3;%0.2f::@7$11=@6$3/$3;%0.2f::@8$11=@7$3/$3;%0.2f::@9$11=@8$3/$3;%0.2f
#+TBLFM: @3$12=@2$6/$6;%0.2f::@4$12=@3$6/$6;%0.2f::@5$12=@4$6/$6;%0.2f::@6$12=@5$6/$6;%0.2f::@7$12=@6$6/$6;%0.2f::@8$12=@7$6/$6;%0.2f::@9$12=@8$6/$6;%0.2f
#+TBLFM: @3$13=@2$10/$10;%0.2f::@4$13=@3$10/$10;%0.2f::@5$13=@4$10/$10;%0.2f::@6$13=@5$10/$10;%0.2f::@7$13=@6$10/$10;%0.2f::@8$13=@7$10/$10;%0.2f::@9$13=@8$10/$10;%0.2f

This is another improvement to support the ordering discussed on the
parent. It has a dramatic effect on the choices/failures. That makes
createState stick out even more.

|  w | m | choice |   fail | #iter(fix)/C |      #CS | #L | time | nbNode |    #CS/#N | Choice-Rate | CS-Rate | CS/N-Rate |
|----+---+--------+--------+--------------+----------+----+------+--------+-----------+-------------+---------+-----------|
|  1 | 3 | 375140 | 185287 |         1.55 | 12356839 | 40 | 18.3 |     40 | 308920.98 |             |         |           |
|  2 | 3 |   5100 |    267 |         2.67 |  5085097 | 40 |  5.2 |     80 |  63563.71 |       73.56 |    2.43 |      4.86 |
|  4 | 3 |   5224 |    329 |         2.61 |  5290798 | 40 |  4.9 |    160 |  33067.49 |        0.98 |    0.96 |      1.92 |
|  8 | 3 |   4832 |    133 |         2.68 |  6905642 | 40 |  7.2 |    320 |  21580.13 |        1.08 |    0.77 |      1.53 |
| 16 | 3 |   4738 |     86 |         2.70 |  9919989 | 40 | 10.9 |    640 |  15499.98 |        1.02 |    0.70 |      1.39 |
| 32 | 3 |   4668 |     51 |         2.71 | 18614374 | 40 | 18.9 |   1280 |  14542.48 |        1.01 |    0.53 |      1.07 |
| 64 | 3 |   4606 |     20 |         2.73 | 52552898 | 40 | 49.6 |   2560 |  20528.48 |        1.01 |    0.35 |      0.71 |
#+TBLFM: $9=$1*$7::$10=$6/$9;%0.2f
#+TBLFM: @3$11=@2$3/$3;%0.2f::@4$11=@3$3/$3;%0.2f::@5$11=@4$3/$3;%0.2f::@6$11=@5$3/$3;%0.2f::@7$11=@6$3/$3;%0.2f::@8$11=@7$3/$3;%0.2f
#+TBLFM: @3$12=@2$6/$6;%0.2f::@4$12=@3$6/$6;%0.2f::@5$12=@4$6/$6;%0.2f::@6$12=@5$6/$6;%0.2f::@7$12=@6$6/$6;%0.2f::@8$12=@7$6/$6;%0.2f
#+TBLFM: @3$13=@2$10/$10;%0.2f::@4$13=@3$10/$10;%0.2f::@5$13=@4$10/$10;%0.2f::@6$13=@5$10/$10;%0.2f::@7$13=@6$10/$10;%0.2f::@8$13=@7$10/$10;%0.2f

|  w | m | choice |   fail | #iter(fix)/C |      #CS | #L | time | nbNode |    #CS/#N | Choice-Rate | CS-Rate | CS/N-Rate |
|----+---+--------+--------+--------------+----------+----+------+--------+-----------+-------------+---------+-----------|
|  1 | 1 | 375140 | 185287 |      1.05137 |  4777581 | 40 |  5.3 |     40 | 119439.53 |             |         |           |
|  2 | 1 |   5112 |    273 |      1.66451 |  4270495 | 40 |  4.1 |     80 |  53381.19 |       73.38 |    1.12 |      2.24 |
|  4 | 1 |   5204 |    319 |      1.63816 |  4520689 | 40 |  3.8 |    160 |  28254.31 |        0.98 |    0.94 |      1.89 |
|  8 | 1 |   4864 |    149 |      1.66283 |  5734575 | 40 |  4.9 |    320 |  17920.55 |        1.07 |    0.79 |      1.58 |
| 16 | 1 |   4732 |     83 |      1.67392 |  8369057 | 40 |  7.6 |    640 |  13076.65 |        1.03 |    0.69 |      1.37 |
| 32 | 1 |   4658 |     46 |      1.68463 | 13534043 | 40 | 13.2 |   1280 |  10573.47 |        1.02 |    0.62 |      1.24 |
| 64 | 1 |   4614 |     24 |      1.69072 | 23265798 | 40 | 23.9 |   2560 |   9088.20 |        1.01 |    0.58 |      1.16 |
#+TBLFM: $9=$1*$7::$10=$6/$9;%0.2f
#+TBLFM: @3$11=@2$3/$3;%0.2f::@4$11=@3$3/$3;%0.2f::@5$11=@4$3/$3;%0.2f::@6$11=@5$3/$3;%0.2f::@7$11=@6$3/$3;%0.2f::@8$11=@7$3/$3;%0.2f
#+TBLFM: @3$12=@2$6/$6;%0.2f::@4$12=@3$6/$6;%0.2f::@5$12=@4$6/$6;%0.2f::@6$12=@5$6/$6;%0.2f::@7$12=@6$6/$6;%0.2f::@8$12=@7$6/$6;%0.2f
#+TBLFM: @3$13=@2$10/$10;%0.2f::@4$13=@3$10/$10;%0.2f::@5$13=@4$10/$10;%0.2f::@6$13=@5$10/$10;%0.2f::@7$13=@6$10/$10;%0.2f::@8$13=@7$10/$10;%0.2f


#+BEGIN_SRC emacs-lisp :exports results :results table
  (org-table-import (expand-file-name "/tmp/saved.csv") nil)
#+END_SRC

** AllInterval
| size | m |   w | nodes | fails |  iter |     nbCS | layers |    time |
|------+---+-----+-------+-------+-------+----------+--------+---------|
|    8 | 0 |   1 |   962 |   442 |     0 |        0 |      0 |    0.01 |
|    8 | 0 |   2 |   962 |   442 |     0 |        0 |      0 |    0.01 |
|    8 | 0 |   4 |   962 |   442 |     0 |        0 |      0 |    0.01 |
|    8 | 0 |   8 |   962 |   442 |     0 |        0 |      0 |   0.009 |
|    8 | 0 |  16 |   962 |   442 |     0 |        0 |      0 |   0.009 |
|    8 | 0 |  32 |   962 |   442 |     0 |        0 |      0 |    0.01 |
|    8 | 0 |  64 |   962 |   442 |     0 |        0 |      0 |   0.009 |
|    8 | 1 |   1 |   642 |   282 |     0 |        0 |      0 |   0.008 |
|    8 | 1 |   2 |   642 |   282 |     0 |        0 |      0 |   0.008 |
|    8 | 1 |   4 |   642 |   282 |     0 |        0 |      0 |   0.008 |
|    8 | 1 |   8 |   642 |   282 |     0 |        0 |      0 |   0.008 |
|    8 | 1 |  16 |   642 |   282 |     0 |        0 |      0 |   0.008 |
|    8 | 1 |  32 |   642 |   282 |     0 |        0 |      0 |   0.008 |
|    8 | 1 |  64 |   642 |   282 |     0 |        0 |      0 |   0.008 |
|    8 | 2 |   1 |   642 |   282 |  1419 |     9800 |     15 |   0.021 |
|    8 | 2 |   2 |   156 |    39 |   339 |   138568 |     15 |   0.111 |
|    8 | 2 |   4 |    92 |     7 |   188 |   198099 |     15 |   0.137 |
|    8 | 2 |   8 |    80 |     1 |   161 |   171282 |     15 |   0.122 |
|    8 | 2 |  16 |    78 |     0 |   158 |   230083 |     15 |    0.16 |
|    8 | 2 |  32 |    78 |     0 |   158 |   275634 |     15 |   0.202 |
|    8 | 2 |  64 |    78 |     0 |   158 |   354789 |     15 |   0.317 |
|    8 | 3 |   1 |   642 |   282 |   722 |     2485 |     15 |   0.018 |
|    8 | 3 |   2 |   138 |    30 |   252 |   102079 |     15 |   0.083 |
|    8 | 3 |   4 |    90 |     6 |   178 |   124402 |     15 |   0.088 |
|    8 | 3 |   8 |    78 |     0 |   158 |   154419 |     15 |   0.111 |
|    8 | 3 |  16 |    78 |     0 |   158 |   211062 |     15 |   0.139 |
|    8 | 3 |  32 |    78 |     0 |   158 |   275336 |     15 |   0.205 |
|    8 | 3 |  64 |    78 |     0 |   158 |   354789 |     15 |   0.315 |
|    9 | 0 |   1 |  3256 |  1509 |     0 |        0 |      0 |   0.037 |
|    9 | 0 |   2 |  3256 |  1509 |     0 |        0 |      0 |   0.038 |
|    9 | 0 |   4 |  3256 |  1509 |     0 |        0 |      0 |   0.038 |
|    9 | 0 |   8 |  3256 |  1509 |     0 |        0 |      0 |   0.037 |
|    9 | 0 |  16 |  3256 |  1509 |     0 |        0 |      0 |   0.039 |
|    9 | 0 |  32 |  3256 |  1509 |     0 |        0 |      0 |    0.04 |
|    9 | 0 |  64 |  3256 |  1509 |     0 |        0 |      0 |   0.038 |
|    9 | 1 |   1 |  1894 |   828 |     0 |        0 |      0 |   0.028 |
|    9 | 1 |   2 |  1894 |   828 |     0 |        0 |      0 |   0.027 |
|    9 | 1 |   4 |  1894 |   828 |     0 |        0 |      0 |   0.028 |
|    9 | 1 |   8 |  1894 |   828 |     0 |        0 |      0 |   0.028 |
|    9 | 1 |  16 |  1894 |   828 |     0 |        0 |      0 |   0.027 |
|    9 | 1 |  32 |  1894 |   828 |     0 |        0 |      0 |   0.028 |
|    9 | 1 |  64 |  1894 |   828 |     0 |        0 |      0 |   0.027 |
|    9 | 2 |   1 |  1906 |   834 |  4347 |    32140 |     17 |   0.073 |
|    9 | 2 |   2 |   448 |   105 |   992 |   565405 |     17 |   0.458 |
|    9 | 2 |   4 |   300 |    31 |   599 |   904142 |     17 |   0.681 |
|    9 | 2 |   8 |   244 |     3 |   487 |   848577 |     17 |    0.65 |
|    9 | 2 |  16 |   238 |     0 |   478 |  1048152 |     17 |   0.856 |
|    9 | 2 |  32 |   238 |     0 |   478 |  1501801 |     17 |   1.196 |
|    9 | 2 |  64 |   238 |     0 |   478 |  2119812 |     17 |   1.962 |
|    9 | 3 |   1 |  1894 |   828 |  2134 |     7573 |     17 |   0.073 |
|    9 | 3 |   2 |   452 |   107 |   794 |   412683 |     17 |    0.37 |
|    9 | 3 |   4 |   298 |    30 |   567 |   589496 |     17 |    0.45 |
|    9 | 3 |   8 |   244 |     3 |   487 |   682408 |     17 |   0.531 |
|    9 | 3 |  16 |   238 |     0 |   478 |   933839 |     17 |   0.759 |
|    9 | 3 |  32 |   238 |     0 |   478 |  1395943 |     17 |   1.138 |
|    9 | 3 |  64 |   238 |     0 |   478 |  2117189 |     17 |    1.95 |
|   10 | 0 |   1 | 12246 |  5828 |     0 |        0 |      0 |    0.17 |
|   10 | 0 |   2 | 12246 |  5828 |     0 |        0 |      0 |   0.162 |
|   10 | 0 |   4 | 12246 |  5828 |     0 |        0 |      0 |   0.165 |
|   10 | 0 |   8 | 12246 |  5828 |     0 |        0 |      0 |   0.162 |
|   10 | 0 |  16 | 12246 |  5828 |     0 |        0 |      0 |    0.16 |
|   10 | 0 |  32 | 12246 |  5828 |     0 |        0 |      0 |   0.162 |
|   10 | 0 |  64 | 12246 |  5828 |     0 |        0 |      0 |   0.158 |
|   10 | 1 |   1 |  6216 |  2813 |     0 |        0 |      0 |   0.107 |
|   10 | 1 |   2 |  6216 |  2813 |     0 |        0 |      0 |   0.111 |
|   10 | 1 |   4 |  6216 |  2813 |     0 |        0 |      0 |    0.11 |
|   10 | 1 |   8 |  6216 |  2813 |     0 |        0 |      0 |   0.105 |
|   10 | 1 |  16 |  6216 |  2813 |     0 |        0 |      0 |   0.104 |
|   10 | 1 |  32 |  6216 |  2813 |     0 |        0 |      0 |   0.108 |
|   10 | 1 |  64 |  6216 |  2813 |     0 |        0 |      0 |   0.105 |
|   10 | 2 |   1 |  6288 |  2849 | 14611 |   114218 |     19 |   0.286 |
|   10 | 2 |   2 |  1132 |   271 |  2475 |  2756402 |     19 |   2.416 |
|   10 | 2 |   4 |   714 |    62 |  1435 |  4292524 |     19 |    3.39 |
|   10 | 2 |   8 |   618 |    14 |  1227 |  4459787 |     19 |   3.526 |
|   10 | 2 |  16 |   594 |     2 |  1188 |  5868265 |     19 |   4.446 |
|   10 | 2 |  32 |   596 |     3 |  1191 |  7222127 |     19 |   5.849 |
|   10 | 2 |  64 |   590 |     0 |  1182 | 11664264 |     19 |   10.72 |
|   10 | 3 |   1 |  6216 |  2813 |  6808 |    25318 |     19 |   0.247 |
|   10 | 3 |   2 |  1160 |   285 |  2028 |  2469161 |     19 |   2.171 |
|   10 | 3 |   4 |   696 |    53 |  1349 |  2920818 |     19 |    2.32 |
|   10 | 3 |   8 |   614 |    12 |  1219 |  3955912 |     19 |   3.162 |
|   10 | 3 |  16 |   594 |     2 |  1187 |  5387721 |     19 |   4.119 |
|   10 | 3 |  32 |   600 |     5 |  1196 |  6282276 |     19 |   5.162 |
|   10 | 3 |  64 |   590 |     0 |  1182 | 10811531 |     19 |   9.697 |
|   11 | 0 |   1 | 48612 | 23659 |     0 |        0 |      0 |   0.727 |
|   11 | 0 |   2 | 48612 | 23659 |     0 |        0 |      0 |   0.704 |
|   11 | 0 |   4 | 48612 | 23659 |     0 |        0 |      0 |   0.708 |
|   11 | 0 |   8 | 48612 | 23659 |     0 |        0 |      0 |     0.7 |
|   11 | 0 |  16 | 48612 | 23659 |     0 |        0 |      0 |   0.711 |
|   11 | 0 |  32 | 48612 | 23659 |     0 |        0 |      0 |   0.705 |
|   11 | 0 |  64 | 48612 | 23659 |     0 |        0 |      0 |   0.707 |
|   11 | 1 |   1 | 21418 | 10062 |     0 |        0 |      0 |   0.403 |
|   11 | 1 |   2 | 21418 | 10062 |     0 |        0 |      0 |   0.408 |
|   11 | 1 |   4 | 21418 | 10062 |     0 |        0 |      0 |   0.404 |
|   11 | 1 |   8 | 21418 | 10062 |     0 |        0 |      0 |   0.433 |
|   11 | 1 |  16 | 21418 | 10062 |     0 |        0 |      0 |   0.412 |
|   11 | 1 |  32 | 21418 | 10062 |     0 |        0 |      0 |   0.407 |
|   11 | 1 |  64 | 21418 | 10062 |     0 |        0 |      0 |   0.406 |
|   11 | 2 |   1 | 21716 | 10211 | 50647 |   411636 |     21 |   1.097 |
|   11 | 2 |   2 |  2806 |   756 |  6143 | 14962018 |     21 |  13.611 |
|   11 | 2 |   4 |  1548 |   127 |  3122 | 25868535 |     21 |  21.462 |
|   11 | 2 |   8 |  1370 |    38 |  2714 | 25187096 |     21 |  21.057 |
|   11 | 2 |  16 |  1310 |     8 |  2616 | 31719773 |     21 |  25.655 |
|   11 | 2 |  32 |  1296 |     1 |  2593 | 36636026 |     21 |  33.151 |
|   11 | 2 |  64 |  1296 |     1 |  2594 | 57987324 |     21 |  58.291 |
|   11 | 3 |   1 | 21418 | 10062 | 22714 |    87747 |     21 |   0.938 |
|   11 | 3 |   2 |  2864 |   785 |  4879 | 14599594 |     21 |  13.835 |
|   11 | 3 |   4 |  1504 |   105 |  2921 | 18047820 |     21 |  15.036 |
|   11 | 3 |   8 |  1384 |    45 |  2723 | 19652716 |     21 |  16.573 |
|   11 | 3 |  16 |  1312 |     9 |  2616 | 27846264 |     21 |  23.207 |
|   11 | 3 |  32 |  1304 |     5 |  2604 | 31774544 |     21 |  29.206 |
|   11 | 3 |  64 |  1296 |     1 |  2593 | 51951984 |     21 |  51.802 |

** Among4Relax
| m |    w |   nodes |  fails |    iter |    nbCS | layers |   time |
|---+------+---------+--------+---------+---------+--------+--------|
| 1 |    1 | 1586528 | 793240 | 1586529 | 2020406 |     50 | 13.792 |
| 1 |    2 |     102 |     27 |     103 | 1200842 |     50 |  0.585 |
| 1 |    4 |   35544 |  17748 |   35545 | 2850609 |     50 |  1.748 |
| 1 |    8 |    4026 |   1989 |    4027 | 1940347 |     50 |  0.837 |
| 1 |   16 |    5098 |   2525 |    5099 | 1718405 |     50 |  0.846 |
| 1 |   32 |     226 |     89 |     227 |  799430 |     50 |   0.48 |
| 1 |   64 |      48 |      0 |      49 |  956557 |     50 |  0.842 |
| 1 |  128 |      48 |      0 |      49 | 1722748 |     50 |  1.768 |
| 1 |  256 |      48 |      0 |      49 | 2531680 |     50 |  3.691 |
| 1 |  512 |      48 |      0 |      49 | 2847375 |     50 |   6.53 |
| 1 | 1024 |      48 |      0 |      49 | 2731703 |     50 | 11.216 |
| 1 | 2048 |      48 |      0 |      49 | 1427112 |     50 |  5.017 |


** Among Nurse
| m |  w |  nodes |  fails |   iter |     nbCS | layers |   time |
|---+----+--------+--------+--------+----------+--------+--------|
| 1 |  1 | 375140 | 185287 | 375141 |  1116797 |     40 |  6.317 |
| 1 |  2 |   5150 |    292 |   5151 |  4264527 |     40 |  4.202 |
| 1 |  4 |   5220 |    327 |   5221 |  4506435 |     40 |   4.35 |
| 1 |  8 |   4868 |    151 |   4869 |  5723544 |     40 |  5.671 |
| 1 | 16 |   4734 |     84 |   4735 |  8362696 |     40 |  8.141 |
| 1 | 32 |   4658 |     46 |   4659 | 13527419 |     40 | 12.681 |
| 1 | 64 |   4614 |     24 |   4615 | 23262045 |     40 | 24.511 |
| 2 |  1 | 375140 | 185287 | 375141 |  1116797 |     40 |  5.866 |
| 2 |  2 |   5318 |    376 |   5319 |  4304833 |     40 |  4.171 |
| 2 |  4 |   5204 |    319 |   5205 |  4430911 |     40 |  3.812 |
| 2 |  8 |   4842 |    138 |   4843 |  5639406 |     40 |  5.485 |
| 2 | 16 |   4728 |     81 |   4729 |  8435389 |     40 |  7.887 |
| 2 | 32 |   4650 |     42 |   4651 | 13429027 |     40 | 13.624 |
| 2 | 64 |   4604 |     19 |   4605 | 22129139 |     40 | 21.681 |
| 3 |  1 | 375140 | 185287 | 565189 |  1347131 |     40 |  20.57 |
| 3 |  2 |   4926 |    180 |  10123 |  4818983 |     40 |  5.042 |
| 3 |  4 |   5292 |    363 |  10476 |  4914782 |     40 |  4.568 |
| 3 |  8 |   4848 |    141 |   9784 |  6636594 |     40 |  5.891 |
| 3 | 16 |   4730 |     82 |   9610 | 10191644 |     40 |  9.773 |
| 3 | 32 |   4658 |     46 |   9510 | 20556171 |     40 | 17.912 |
| 3 | 64 |   4608 |     21 |   9430 | 47743193 |     40 | 41.471 |


* New Serie <2020-05-15 Fri>
- Reboot unrestricted for everything except workForce 
- WorkForce restricts reboot to maxDistance=0

** ~AmongNurse~
*** ~AmongNurse~ With refresh on node split.
#+BEGIN_SRC emacs-lisp :exports results :results table
  (org-table-import (expand-file-name "/tmp/saved.csv") nil)
#+END_SRC
| m |  w |  nodes |  fails |   iter |     nbCS | layers |  splitCS | pruneCS |     pot |   time |
| 1 |  1 | 375140 | 185287 | 375141 |  1116757 |     40 |        0 |       0 |       0 |  6.407 |
| 1 |  2 |   6572 |   1003 |   6573 |  4025244 |     40 |  2653925 |  219819 | 1109085 |  5.059 |
| 1 |  4 |   5700 |    567 |   5701 |  3543813 |     40 |  2324553 |  186069 |  951202 |  3.898 |
| 1 |  8 |   5072 |    253 |   5073 |  4911817 |     40 |  3085930 |  190102 |  973384 |   4.55 |
| 1 | 16 |   4886 |    160 |   4887 |  7389793 |     40 |  4416302 |  186673 |  958995 |  8.066 |
| 1 | 32 |   4786 |    110 |   4787 | 12831820 |     40 |  7303509 |  185546 |  949580 | 12.214 |
| 1 | 64 |   4740 |     87 |   4741 | 22640040 |     40 | 12458952 |  185032 |  939531 | 23.009 |
| 2 |  1 | 375140 | 185287 | 375141 |  1116757 |     40 |        0 |       0 |       0 |  5.914 |
| 2 |  2 |   7362 |   1398 |   7363 |  6055504 |     40 |  4000013 |  330012 | 1671517 |  6.307 |
| 2 |  4 |   5974 |    704 |   5975 |  3573133 |     40 |  2342543 |  186672 |  960157 |   3.63 |
| 2 |  8 |   5106 |    270 |   5107 |  4921926 |     40 |  3093721 |  191267 |  980433 |  4.337 |
| 2 | 16 |   4916 |    175 |   4917 |  7295326 |     40 |  4367201 |  186922 |  963183 |  7.447 |
| 2 | 32 |   4798 |    116 |   4799 | 12740295 |     40 |  7254355 |  184517 |  946680 | 12.284 |
| 2 | 64 |   4742 |     88 |   4743 | 22628732 |     40 | 12459818 |  184583 |  939231 | 22.735 |
| 3 |  1 | 375140 | 185287 | 565189 |  1347091 |     40 |        0 |       0 |       0 | 23.029 |
| 3 |  2 |   5398 |    416 |  11389 |  4591104 |     40 |  3028241 |  267199 | 1268896 |  6.204 |
| 3 |  4 |   5304 |    369 |  10757 |  4075184 |     40 |  2641956 |  224987 | 1045261 |  5.225 |
| 3 |  8 |   4864 |    149 |   9892 |  5203517 |     40 |  3274414 |  231182 | 1063686 |  5.612 |
| 3 | 16 |   4736 |     85 |   9665 |  8230875 |     40 |  4893993 |  226646 | 1066924 |  9.845 |
| 3 | 32 |   4650 |     42 |   9517 | 13417848 |     40 |  7637156 |  231632 | 1063304 | 15.479 |
| 3 | 64 |   4608 |     21 |   9444 | 23940065 |     40 | 13153403 |  230720 | 1059905 | 27.898 |
*** ~AmongNurse~ Without refresh on node split. WITHOUT caching
#+BEGIN_SRC emacs-lisp :exports results :results table
  (org-table-import (expand-file-name "/tmp/saved.csv") nil)
#+END_SRC
| m |  w |  nodes |  fails |   iter |     nbCS | layers |  splitCS | pruneCS |     pot |   time |
|---+----+--------+--------+--------+----------+--------+----------+---------+---------+--------|
| 1 |  1 | 375140 | 185287 | 375141 |  1116757 |     40 |        0 |       0 |       0 |  6.465 |
| 1 |  2 |  10044 |   2739 |  10045 |  7212147 |     40 |  7098319 |  578923 | 2967467 |  9.675 |
| 1 |  4 |   7138 |   1286 |   7139 |  4306430 |     40 |  4241629 |  329477 | 1739306 |  4.815 |
| 1 |  8 |   6048 |    741 |   6049 |  4586125 |     40 |  4526413 |  254003 | 1403506 |  5.731 |
| 1 | 16 |   5512 |    473 |   5513 |  6938511 |     40 |  6879404 |  248924 | 1426121 |  8.335 |
| 1 | 32 |   5036 |    235 |   5037 | 10639703 |     40 | 10584715 |  225721 | 1307588 | 11.319 |
| 1 | 64 |   4800 |    117 |   4801 | 16803907 |     40 | 16750745 |  210083 | 1220569 | 18.414 |
| 2 |  1 | 375140 | 185287 | 375141 |  1116757 |     40 |        0 |       0 |       0 |  5.927 |
| 2 |  2 |  13178 |   4306 |  13179 | 11157595 |     40 | 10997436 |  907748 | 4580548 | 12.926 |
| 2 |  4 |   8148 |   1791 |   8149 |  4518380 |     40 |  4433301 |  337329 | 1806439 |  5.419 |
| 2 |  8 |   6588 |   1011 |   6589 |  4716818 |     40 |  4641890 |  262218 | 1481113 |  5.308 |
| 2 | 16 |   5856 |    645 |   5857 |  7433919 |     40 |  7360117 |  253977 | 1525840 |  7.348 |
| 2 | 32 |   5174 |    304 |   5175 |  9954863 |     40 |  9890773 |  212541 | 1304817 |  9.435 |
| 2 | 64 |   4870 |    152 |   4871 | 14817970 |     40 | 14759625 |  194764 | 1172571 | 14.256 |
| 3 |  1 | 375140 | 185287 | 565189 |  1347091 |     40 |        0 |       0 |       0 | 23.155 |
| 3 |  2 |   4988 |    211 |  10172 |  3741674 |     40 |  3684645 |  325587 | 1539291 |  5.678 |
| 3 |  4 |   5206 |    320 |  10638 |  3194673 |     40 |  3125118 |  271178 | 1261929 |  4.338 |
| 3 |  8 |   4838 |    136 |   9934 |  4174458 |     40 |  4102184 |  276330 | 1302821 |  6.078 |
| 3 | 16 |   4726 |     80 |   9687 |  5323705 |     40 |  5244917 |  235364 | 1118103 |   6.85 |
| 3 | 32 |   4658 |     46 |   9557 |  8514473 |     40 |  8427681 |  241005 | 1117756 |  9.015 |
| 3 | 64 |   4608 |     21 |   9486 | 13660495 |     40 | 13563470 |  237360 | 1096025 | 16.108 |

*** ~AmongNurse~ Without refresh on node split. WITH caching
#+BEGIN_SRC emacs-lisp :exports results :results table
  (org-table-import (expand-file-name "/tmp/saved.csv") nil)
#+END_SRC
| m |  w |  nodes |  fails |   iter |    nbCS | layers |  splitCS | pruneCS |     pot |   time |
| 1 |  1 | 375140 | 185287 | 375141 | 1116757 |     40 |        0 |       0 |       0 |  6.395 |
| 1 |  2 |  10044 |   2739 |  10045 | 3777237 |     40 |  7098319 |  578923 | 2967467 | 20.264 |
| 1 |  4 |   7138 |   1286 |   7139 | 2214353 |     40 |  4241629 |  329477 | 1739306 |  8.236 |
| 1 |  8 |   6048 |    741 |   6049 | 1810093 |     40 |  4526413 |  254003 | 1403506 |  7.152 |
| 1 | 16 |   5512 |    473 |   5513 | 1845541 |     40 |  6879404 |  248924 | 1426121 | 10.026 |
| 1 | 32 |   5036 |    235 |   5037 | 1697043 |     40 | 10584715 |  225721 | 1307588 | 10.327 |
| 1 | 64 |   4800 |    117 |   4801 | 1584058 |     40 | 16750745 |  210083 | 1220569 | 15.834 |
| 2 |  1 | 375140 | 185287 | 375141 | 1116757 |     40 |        0 |       0 |       0 |  5.877 |
| 2 |  2 |  13178 |   4306 |  13179 | 5831184 |     40 | 10997436 |  907748 | 4580548 | 15.765 |
| 2 |  4 |   8148 |   1791 |   8149 | 2355995 |     40 |  4433301 |  337329 | 1806439 |  7.111 |
| 2 |  8 |   6588 |   1011 |   6589 | 1960640 |     40 |  4641890 |  262218 | 1481113 |  4.623 |
| 2 | 16 |   5856 |    645 |   5857 | 2031197 |     40 |  7360117 |  253977 | 1525840 |  5.251 |
| 2 | 32 |   5174 |    304 |   5175 | 1745959 |     40 |  9890773 |  212541 | 1304817 |  6.087 |
| 2 | 64 |   4870 |    152 |   4871 | 1554512 |     40 | 14759625 |  194764 | 1172571 |   9.35 |
| 3 |  1 | 375140 | 185287 | 565189 | 1347091 |     40 |        0 |       0 |       0 | 23.065 |
| 3 |  2 |   4988 |    211 |  10172 | 1938965 |     40 |  3684645 |  325587 | 1539291 |  6.712 |
| 3 |  4 |   5206 |    320 |  10638 | 1630993 |     40 |  3125118 |  271178 | 1261929 |  5.266 |
| 3 |  8 |   4838 |    136 |   9934 | 1685142 |     40 |  4102184 |  276330 | 1302821 |  6.967 |
| 3 | 16 |   4726 |     80 |   9687 | 1470247 |     40 |  5244917 |  235364 | 1118103 |  6.386 |
| 3 | 32 |   4658 |     46 |   9557 | 1487571 |     40 |  8427681 |  241005 | 1117756 |  6.592 |
| 3 | 64 |   4608 |     21 |   9486 | 1463402 |     40 | 13563470 |  237360 | 1096025 | 11.336 |

** ~allInterval~

*** Without refresh on node split. WITH caching
#+BEGIN_SRC emacs-lisp :exports results :results table
  (org-table-import (expand-file-name "/tmp/saved.csv") nil)
#+END_SRC
| size | m |  w | nodes | fails |  iter |    nbCS | layers |  splitCS | pruneCS |     pot |    hitCS | HRate |   time |
|------+---+----+-------+-------+-------+---------+--------+----------+---------+---------+----------+-------+--------|
|    8 | 0 |  1 |   962 |   442 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.012 |
|    8 | 0 |  2 |   962 |   442 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.012 |
|    8 | 0 |  4 |   962 |   442 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.012 |
|    8 | 0 |  8 |   962 |   442 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.012 |
|    8 | 0 | 16 |   962 |   442 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.012 |
|    8 | 0 | 32 |   962 |   442 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.012 |
|    8 | 0 | 64 |   962 |   442 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.012 |
|    8 | 1 |  1 |   642 |   282 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.01 |
|    8 | 1 |  2 |   642 |   282 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.01 |
|    8 | 1 |  4 |   642 |   282 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.01 |
|    8 | 1 |  8 |   642 |   282 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.01 |
|    8 | 1 | 16 |   642 |   282 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.01 |
|    8 | 1 | 32 |   642 |   282 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.01 |
|    8 | 1 | 64 |   642 |   282 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.01 |
|    8 | 2 |  1 |   642 |   282 |  1551 |    9710 |     15 |        0 |       0 |       0 |        0 |  0.00 |  0.029 |
|    8 | 2 |  2 |   158 |    40 |   447 |   32130 |     15 |    94896 |    9365 |   12580 |    66597 |  0.67 |  0.095 |
|    8 | 2 |  4 |    92 |     7 |   266 |   37351 |     15 |   135412 |   13354 |   16509 |   100741 |  0.73 |   0.11 |
|    8 | 2 |  8 |    78 |     0 |   198 |   32687 |     15 |   134165 |   12659 |   14625 |   103528 |  0.76 |  0.105 |
|    8 | 2 | 16 |    78 |     0 |   191 |   36294 |     15 |   169203 |   14595 |   15776 |   135128 |  0.79 |  0.129 |
|    8 | 2 | 32 |    78 |     0 |   172 |   42695 |     15 |   290674 |   18900 |   20613 |   249757 |  0.85 |  0.206 |
|    8 | 2 | 64 |    78 |     0 |   163 |   55135 |     15 |   506035 |   29195 |   27096 |   453892 |  0.89 |  0.362 |
|    8 | 3 |  1 |   642 |   282 |   722 |    2387 |     15 |        0 |       0 |       0 |        0 |  0.00 |   0.02 |
|    8 | 3 |  2 |   158 |    40 |   347 |   22691 |     15 |    73348 |    6763 |    9929 |    53246 |  0.70 |  0.072 |
|    8 | 3 |  4 |    96 |     9 |   243 |   28737 |     15 |   108294 |   10313 |   13369 |    81681 |  0.74 |  0.093 |
|    8 | 3 |  8 |    78 |     0 |   193 |   29771 |     15 |   125198 |   11619 |   13595 |    97337 |  0.77 |  0.099 |
|    8 | 3 | 16 |    78 |     0 |   185 |   32543 |     15 |   157404 |   12916 |   14581 |   126928 |  0.80 |  0.118 |
|    8 | 3 | 32 |    78 |     0 |   171 |   41951 |     15 |   288941 |   18734 |   20444 |   248766 |  0.86 |  0.203 |
|    8 | 3 | 64 |    78 |     0 |   163 |   55135 |     15 |   506035 |   29195 |   27096 |   453892 |  0.89 |   0.37 |
|    9 | 0 |  1 |  3256 |  1509 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.039 |
|    9 | 0 |  2 |  3256 |  1509 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.041 |
|    9 | 0 |  4 |  3256 |  1509 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.04 |
|    9 | 0 |  8 |  3256 |  1509 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.039 |
|    9 | 0 | 16 |  3256 |  1509 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.039 |
|    9 | 0 | 32 |  3256 |  1509 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.04 |
|    9 | 0 | 64 |  3256 |  1509 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.039 |
|    9 | 1 |  1 |  1894 |   828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.029 |
|    9 | 1 |  2 |  1894 |   828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.029 |
|    9 | 1 |  4 |  1894 |   828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.029 |
|    9 | 1 |  8 |  1894 |   828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.03 |
|    9 | 1 | 16 |  1894 |   828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.029 |
|    9 | 1 | 32 |  1894 |   828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.029 |
|    9 | 1 | 64 |  1894 |   828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.028 |
|    9 | 2 |  1 |  1906 |   834 |  4794 |   32035 |     17 |        0 |       0 |       0 |        0 |  0.00 |  0.087 |
|    9 | 2 |  2 |   468 |   115 |  1314 |  135359 |     17 |   472159 |   46470 |   56219 |   348682 |  0.72 |    0.4 |
|    9 | 2 |  4 |   284 |    23 |   784 |  165921 |     17 |   679408 |   68260 |   74348 |   521473 |  0.76 |   0.53 |
|    9 | 2 |  8 |   256 |     9 |   666 |  170772 |     17 |   755123 |   75116 |   75109 |   591802 |  0.78 |  0.584 |
|    9 | 2 | 16 |   242 |     2 |   584 |  144830 |     17 |   773719 |   62270 |   64352 |   635472 |  0.81 |  0.611 |
|    9 | 2 | 32 |   240 |     1 |   526 |  147373 |     17 |  1063347 |   66784 |   65400 |   922829 |  0.86 |  0.808 |
|    9 | 2 | 64 |   238 |     0 |   500 |  218542 |     17 |  2147553 |  104267 |   98873 |  1935615 |  0.90 |  1.701 |
|    9 | 3 |  1 |  1894 |   828 |  2134 |    7445 |     17 |        0 |       0 |       0 |        0 |  0.00 |  0.073 |
|    9 | 3 |  2 |   468 |   115 |  1028 |   87348 |     17 |   322678 |   29394 |   39728 |   243051 |  0.74 |  0.291 |
|    9 | 3 |  4 |   296 |    29 |   751 |  113456 |     17 |   464287 |   43091 |   53217 |   357846 |  0.76 |  0.381 |
|    9 | 3 |  8 |   246 |     4 |   612 |  145454 |     17 |   668671 |   63868 |   66741 |   529483 |  0.78 |  0.529 |
|    9 | 3 | 16 |   238 |     0 |   557 |  134610 |     17 |   751533 |   58944 |   62245 |   622767 |  0.82 |   0.61 |
|    9 | 3 | 32 |   238 |     0 |   515 |  134381 |     17 |   970030 |   61515 |   61497 |   841529 |  0.86 |  0.736 |
|    9 | 3 | 64 |   238 |     0 |   502 |  214115 |     17 |  2128227 |  102329 |   98015 |  1920922 |  0.90 |  1.635 |
|   10 | 0 |  1 | 12246 |  5828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.166 |
|   10 | 0 |  2 | 12246 |  5828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.158 |
|   10 | 0 |  4 | 12246 |  5828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.159 |
|   10 | 0 |  8 | 12246 |  5828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.162 |
|   10 | 0 | 16 | 12246 |  5828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.16 |
|   10 | 0 | 32 | 12246 |  5828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.159 |
|   10 | 0 | 64 | 12246 |  5828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.162 |
|   10 | 1 |  1 |  6216 |  2813 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.106 |
|   10 | 1 |  2 |  6216 |  2813 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.107 |
|   10 | 1 |  4 |  6216 |  2813 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.107 |
|   10 | 1 |  8 |  6216 |  2813 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.106 |
|   10 | 1 | 16 |  6216 |  2813 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.106 |
|   10 | 1 | 32 |  6216 |  2813 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.109 |
|   10 | 1 | 64 |  6216 |  2813 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.107 |
|   10 | 2 |  1 |  6288 |  2849 | 16037 |  114163 |     19 |        0 |       0 |       0 |        0 |  0.00 |  0.338 |
|   10 | 2 |  2 |  1156 |   283 |  3255 |  644917 |     19 |  2702897 |  263612 |  291255 |  2088716 |  0.76 |  2.283 |
|   10 | 2 |  4 |   712 |    61 |  2030 |  877698 |     19 |  4054694 |  414478 |  392981 |  3199679 |  0.78 |  3.584 |
|   10 | 2 |  8 |   632 |    21 |  1618 | 1178103 |     19 |  6342323 |  690112 |  539859 |  5183153 |  0.81 |  6.904 |
|   10 | 2 | 16 |   614 |    12 |  1498 |  728974 |     19 |  4217774 |  350861 |  315537 |  3511287 |  0.83 |  3.547 |
|   10 | 2 | 32 |   598 |     4 |  1332 |  645313 |     19 |  4627137 |  310021 |  287057 |  3999213 |  0.86 |    3.9 |
|   10 | 2 | 64 |   592 |     1 |  1245 |  641602 |     19 |  6800076 |  318816 |  286039 |  6173514 |  0.91 |  5.649 |
|   10 | 3 |  1 |  6216 |  2813 |  6808 |   25156 |     19 |        0 |       0 |       0 |        0 |  0.00 |  0.261 |
|   10 | 3 |  2 |  1212 |   311 |  2593 |  494363 |     19 |  2214613 |  205062 |  241349 |  1740836 |  0.78 |  1.943 |
|   10 | 3 |  4 |   726 |    68 |  1844 |  549510 |     19 |  2558872 |  235057 |  266506 |  2027640 |  0.79 |  2.081 |
|   10 | 3 |  8 |   614 |    12 |  1524 |  595626 |     19 |  3085916 |  273531 |  277411 |  2507925 |  0.81 |  2.525 |
|   10 | 3 | 16 |   602 |     6 |  1432 |  733823 |     19 |  4384594 |  351938 |  332131 |  3670624 |  0.83 |  3.412 |
|   10 | 3 | 32 |   600 |     5 |  1341 |  644221 |     19 |  4634809 |  304718 |  291171 |  4010040 |  0.86 |  4.023 |
|   10 | 3 | 64 |   592 |     1 |  1235 |  612606 |     19 |  6553282 |  304298 |  276215 |  5955328 |  0.91 |  5.485 |
|   11 | 0 |  1 | 48612 | 23659 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.711 |
|   11 | 0 |  2 | 48612 | 23659 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.698 |
|   11 | 0 |  4 | 48612 | 23659 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.704 |
|   11 | 0 |  8 | 48612 | 23659 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.698 |
|   11 | 0 | 16 | 48612 | 23659 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.704 |
|   11 | 0 | 32 | 48612 | 23659 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.702 |
|   11 | 0 | 64 | 48612 | 23659 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |    0.7 |
|   11 | 1 |  1 | 21418 | 10062 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.406 |
|   11 | 1 |  2 | 21418 | 10062 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.405 |
|   11 | 1 |  4 | 21418 | 10062 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.408 |
|   11 | 1 |  8 | 21418 | 10062 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.412 |
|   11 | 1 | 16 | 21418 | 10062 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.404 |
|   11 | 1 | 32 | 21418 | 10062 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.43 |
|   11 | 1 | 64 | 21418 | 10062 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.414 |
|   11 | 2 |  1 | 21716 | 10211 | 55433 |  411846 |     21 |        0 |       0 |       0 |        0 |  0.00 |  1.359 |
|   11 | 2 |  2 |  3006 |   856 |  8332 | 3475912 |     21 | 16388654 | 1604708 | 1610141 | 12995506 |  0.79 | 14.504 |
|   11 | 2 |  4 |  1598 |   152 |  4679 | 4330527 |     21 | 21921015 | 2203248 | 1969751 | 17648655 |  0.80 | 20.318 |
|   11 | 2 |  8 |  1364 |    35 |  3647 | 6838768 |     21 | 39632685 | 4143847 | 3094179 | 32842855 |  0.83 | 64.621 |
|   11 | 2 | 16 |  1326 |    16 |  3209 | 3454530 |     21 | 21655191 | 1798695 | 1508148 | 18250177 |  0.84 | 18.391 |
|   11 | 2 | 32 |  1318 |    12 |  2976 | 3445259 |     21 | 26149374 | 1815075 | 1487869 | 22753600 |  0.87 | 22.008 |
|   11 | 2 | 64 |  1316 |    11 |  2815 | 3208768 |     21 | 33085380 | 1659018 | 1398222 | 29927078 |  0.90 | 28.773 |
|   11 | 3 |  1 | 21418 | 10062 | 22714 |   87547 |     21 |        0 |       0 |       0 |        0 |  0.00 |  0.993 |
|   11 | 3 |  2 |  3014 |   860 |  6434 | 2748945 |     21 | 13575208 | 1254811 | 1347974 | 10881187 |  0.80 | 12.396 |
|   11 | 3 |  4 |  1516 |   111 |  4074 | 2988859 |     21 | 15558891 | 1413038 | 1457446 | 12616807 |  0.81 | 13.046 |
|   11 | 3 |  8 |  1394 |    50 |  3594 | 3204535 |     21 | 18065629 | 1610009 | 1505322 | 14907893 |  0.82 | 15.642 |
|   11 | 3 | 16 |  1332 |    19 |  3109 | 3363497 |     21 | 21715882 | 1733283 | 1532382 | 18398980 |  0.85 | 18.278 |
|   11 | 3 | 32 |  1334 |    20 |  2979 | 3506007 |     21 | 27193180 | 1799712 | 1575163 | 23738170 |  0.87 | 22.131 |
|   11 | 3 | 64 |  1308 |     7 |  2779 | 3118309 |     21 | 32040349 | 1620976 | 1380594 | 28966341 |  0.90 | 27.753 |
#+TBLFM: $13=$12/($12+$7);%0.2f

** ~workForce~

*** Without refresh on node split. WITH caching
#+BEGIN_SRC emacs-lisp :exports results :results table
  (org-table-import (expand-file-name "/tmp/saved.csv") nil)
#+END_SRC
| m |  w | nodes | fails | iter |    nbCS | layers | splitCS | pruneCS |   pot | hitCS |  HRate |   time |
|---+----+-------+-------+------+---------+--------+---------+---------+-------+-------+--------+--------|
| 0 |  1 |   560 |   281 |  901 |    9072 |    100 |       0 |       0 |     0 |     0 | 0.0000 |  0.803 |
| 0 |  2 |   560 |   281 | 1077 |  202346 |    100 |  173765 |      56 |  3730 |     0 | 0.0000 |  3.966 |
| 0 |  4 |   560 |   281 | 1095 |  362263 |    100 |  309877 |      54 |  9912 |     0 | 0.0000 |   7.13 |
| 0 |  8 |   560 |   281 | 1348 |  837664 |    100 |  683279 |    4077 | 28691 |    97 | 0.0001 | 15.194 |
| 0 | 16 |   560 |   281 | 1339 | 1682186 |    100 | 1364970 |    6056 | 52001 |  1215 | 0.0007 | 32.314 |
| 0 | 32 |   560 |   281 | 1345 | 3238317 |    100 | 2601046 |    9652 | 96466 |  9170 | 0.0028 | 73.813 |
#+TBLFM: $12=$11/($11+$6);%0.4f


* After optimizations <2020-05-17 Sun>

** ~AmongNurse~
#+BEGIN_SRC emacs-lisp :exports results :results table
  (org-table-import (expand-file-name "/tmp/saved.csv") nil)
#+END_SRC
| m |  w |  nodes |  fails |   iter |    nbCS | layers |  splitCS | pruneCS |     pot |   time |
|---+----+--------+--------+--------+---------+--------+----------+---------+---------+--------|
| 1 |  1 | 375140 | 185287 | 375141 | 1116757 |     40 |        0 |       0 |       0 |  5.769 |
| 1 |  2 |   8214 |   1824 |   8215 | 1750356 |     40 |  3305146 |  276112 | 1371860 |  3.158 |
| 1 |  4 |   6386 |    910 |   6387 | 1806749 |     40 |  4210423 |  268683 | 1397931 |  3.691 |
| 1 |  8 |   5918 |    676 |   5919 | 1792397 |     40 |  5572831 |  252924 | 1381047 |   4.18 |
| 1 | 16 |   5348 |    391 |   5349 | 1702656 |     40 |  7837020 |  233495 | 1311014 |  5.036 |
| 1 | 32 |   5044 |    239 |   5045 | 1624213 |     40 | 12661401 |  216294 | 1243583 |   7.43 |
| 1 | 64 |   4870 |    152 |   4871 | 1605059 |     40 | 22787093 |  207741 | 1219027 | 13.074 |
| 2 |  1 | 375140 | 185287 | 375141 | 1116757 |     40 |        0 |       0 |       0 |  6.021 |
| 2 |  2 |   8518 |   1976 |   8519 | 1763198 |     40 |  3298468 |  270326 | 1373284 |  2.548 |
| 2 |  4 |   7792 |   1613 |   7793 | 2174044 |     40 |  4789341 |  303396 | 1643013 |  3.195 |
| 2 |  8 |   6672 |   1053 |   6673 | 2044897 |     40 |  5964240 |  265143 | 1537641 |  3.414 |
| 2 | 16 |   5716 |    575 |   5717 | 1829907 |     40 |  8146343 |  227726 | 1366369 |   3.64 |
| 2 | 32 |   5132 |    283 |   5133 | 1665370 |     40 | 12692701 |  207739 | 1249173 |  4.608 |
| 2 | 64 |   4866 |    150 |   4867 | 1564634 |     40 | 21645596 |  197105 | 1172702 |   7.35 |
| 3 |  1 | 375140 | 185287 | 565189 | 1347091 |     40 |        0 |       0 |       0 | 20.772 |
| 3 |  2 |   7524 |   1479 |  14295 | 1646438 |     40 |  2961700 |  267198 | 1232454 |  3.353 |
| 3 |  4 |   5048 |    241 |  10397 | 1545102 |     40 |  3526372 |  248764 | 1181651 |  3.207 |
| 3 |  8 |   4824 |    129 |   9951 | 1507112 |     40 |  4649079 |  244427 | 1142062 |  3.412 |
| 3 | 16 |   4702 |     68 |   9693 | 1497405 |     40 |  6977708 |  240551 | 1128440 |  4.276 |
| 3 | 32 |   4632 |     33 |   9577 | 1488014 |     40 | 11510279 |  238587 | 1099516 |  5.629 |
| 3 | 64 |   4600 |     17 |   9512 | 1497699 |     40 | 19953728 |  235786 | 1080548 |  9.106 |
Updated as of: <2020-05-19 Tue>


** ~AllInteval~

#+BEGIN_SRC emacs-lisp :exports results :results table
  (org-table-import (expand-file-name "/tmp/saved.csv") nil)
#+END_SRC
| size | m |  w | nodes | fails |  iter |    nbCS | layers |  splitCS | pruneCS |     pot |    hitCS | HRate |   time |
|------+---+----+-------+-------+-------+---------+--------+----------+---------+---------+----------+-------+--------|
|    8 | 0 |  1 |   962 |   442 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.013 |
|    8 | 0 |  2 |   962 |   442 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.012 |
|    8 | 0 |  4 |   962 |   442 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.013 |
|    8 | 0 |  8 |   962 |   442 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.013 |
|    8 | 0 | 16 |   962 |   442 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.014 |
|    8 | 0 | 32 |   962 |   442 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.013 |
|    8 | 0 | 64 |   962 |   442 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.013 |
|    8 | 1 |  1 |   642 |   282 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.012 |
|    8 | 1 |  2 |   642 |   282 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.011 |
|    8 | 1 |  4 |   642 |   282 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.011 |
|    8 | 1 |  8 |   642 |   282 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.011 |
|    8 | 1 | 16 |   642 |   282 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.011 |
|    8 | 1 | 32 |   642 |   282 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.011 |
|    8 | 1 | 64 |   642 |   282 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.011 |
|    8 | 2 |  1 |   642 |   282 |  1551 |    9710 |     15 |        0 |       0 |       0 |        0 |  0.00 |  0.028 |
|    8 | 2 |  2 |   178 |    50 |   507 |   37965 |     15 |   113905 |   11628 |   14985 |    80223 |  0.68 |  0.083 |
|    8 | 2 |  4 |    96 |     9 |   274 |   38508 |     15 |   138392 |   14084 |   16836 |   102552 |  0.73 |  0.092 |
|    8 | 2 |  8 |    80 |     1 |   202 |   34260 |     15 |   140815 |   13358 |   14961 |   108791 |  0.76 |  0.091 |
|    8 | 2 | 16 |    78 |     0 |   189 |   33111 |     15 |   165365 |   12709 |   14727 |   134414 |  0.80 |  0.104 |
|    8 | 2 | 32 |    78 |     0 |   170 |   46222 |     15 |   319145 |   23257 |   23491 |   274688 |  0.86 |  0.189 |
|    8 | 2 | 64 |    78 |     0 |   164 |   57733 |     15 |   539294 |   30321 |   28136 |   484964 |  0.89 |  0.324 |
|    8 | 3 |  1 |   642 |   282 |   722 |    2387 |     15 |        0 |       0 |       0 |        0 |  0.00 |  0.022 |
|    8 | 3 |  2 |   196 |    59 |   405 |   22978 |     15 |    70201 |    6665 |    9657 |    50233 |  0.69 |  0.059 |
|    8 | 3 |  4 |    98 |    10 |   242 |   24645 |     15 |    89980 |    8299 |   11504 |    67414 |  0.73 |  0.067 |
|    8 | 3 |  8 |    80 |     1 |   195 |   30613 |     15 |   131202 |   11619 |   14066 |   102604 |  0.77 |  0.087 |
|    8 | 3 | 16 |    78 |     0 |   183 |   29177 |     15 |   152276 |   11075 |   13470 |   125023 |  0.81 |  0.093 |
|    8 | 3 | 32 |    78 |     0 |   167 |   44298 |     15 |   313528 |   22563 |   22849 |   270946 |  0.86 |  0.183 |
|    8 | 3 | 64 |    78 |     0 |   164 |   57733 |     15 |   539294 |   30321 |   28136 |   484964 |  0.89 |  0.324 |
|    9 | 0 |  1 |  3256 |  1509 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.04 |
|    9 | 0 |  2 |  3256 |  1509 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.046 |
|    9 | 0 |  4 |  3256 |  1509 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.048 |
|    9 | 0 |  8 |  3256 |  1509 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.044 |
|    9 | 0 | 16 |  3256 |  1509 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.041 |
|    9 | 0 | 32 |  3256 |  1509 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.039 |
|    9 | 0 | 64 |  3256 |  1509 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.039 |
|    9 | 1 |  1 |  1894 |   828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.029 |
|    9 | 1 |  2 |  1894 |   828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.03 |
|    9 | 1 |  4 |  1894 |   828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.029 |
|    9 | 1 |  8 |  1894 |   828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.029 |
|    9 | 1 | 16 |  1894 |   828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.029 |
|    9 | 1 | 32 |  1894 |   828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.029 |
|    9 | 1 | 64 |  1894 |   828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.03 |
|    9 | 2 |  1 |  1906 |   834 |  4794 |   32037 |     17 |        0 |       0 |       0 |        0 |  0.00 |  0.076 |
|    9 | 2 |  2 |   550 |   156 |  1494 |  170588 |     17 |   618531 |   62296 |   72666 |   460394 |  0.73 |   0.39 |
|    9 | 2 |  4 |   304 |    33 |   841 |  161128 |     17 |   650225 |   64017 |   72425 |   497176 |  0.76 |  0.408 |
|    9 | 2 |  8 |   256 |     9 |   659 |  166516 |     17 |   756774 |   70904 |   74963 |   597773 |  0.78 |  0.484 |
|    9 | 2 | 16 |   242 |     2 |   590 |  145846 |     17 |   749784 |   62282 |   64929 |   610928 |  0.81 |  0.494 |
|    9 | 2 | 32 |   242 |     2 |   534 |  159449 |     17 |  1170695 |   74301 |   69846 |  1018543 |  0.86 |  0.692 |
|    9 | 2 | 64 |   238 |     0 |   499 |  230572 |     17 |  2490357 |  128548 |  112087 |  2266137 |  0.91 |  1.597 |
|    9 | 3 |  1 |  1894 |   828 |  2134 |    7445 |     17 |        0 |       0 |       0 |        0 |  0.00 |  0.071 |
|    9 | 3 |  2 |   572 |   167 |  1158 |   94278 |     17 |   350728 |   31926 |   43171 |   264952 |  0.74 |  0.252 |
|    9 | 3 |  4 |   298 |    30 |   736 |  111123 |     17 |   461641 |   41973 |   52903 |   357012 |  0.76 |  0.328 |
|    9 | 3 |  8 |   246 |     4 |   610 |  142115 |     17 |   675967 |   61633 |   67164 |   540109 |  0.79 |  0.439 |
|    9 | 3 | 16 |   242 |     2 |   568 |  131062 |     17 |   704551 |   55435 |   61013 |   579823 |  0.82 |  0.474 |
|    9 | 3 | 32 |   240 |     1 |   525 |  139026 |     17 |   981371 |   62312 |   62066 |   849129 |  0.86 |  0.608 |
|    9 | 3 | 64 |   238 |     0 |   497 |  222911 |     17 |  2445363 |  124888 |  109850 |  2229093 |  0.91 |  1.531 |
|   10 | 0 |  1 | 12246 |  5828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.169 |
|   10 | 0 |  2 | 12246 |  5828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.159 |
|   10 | 0 |  4 | 12246 |  5828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.161 |
|   10 | 0 |  8 | 12246 |  5828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.16 |
|   10 | 0 | 16 | 12246 |  5828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.16 |
|   10 | 0 | 32 | 12246 |  5828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.159 |
|   10 | 0 | 64 | 12246 |  5828 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |   0.16 |
|   10 | 1 |  1 |  6216 |  2813 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.105 |
|   10 | 1 |  2 |  6216 |  2813 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.105 |
|   10 | 1 |  4 |  6216 |  2813 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.106 |
|   10 | 1 |  8 |  6216 |  2813 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.104 |
|   10 | 1 | 16 |  6216 |  2813 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.108 |
|   10 | 1 | 32 |  6216 |  2813 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.105 |
|   10 | 1 | 64 |  6216 |  2813 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.103 |
|   10 | 2 |  1 |  6288 |  2849 | 16037 |  114183 |     19 |        0 |       0 |       0 |        0 |  0.00 |  0.297 |
|   10 | 2 |  2 |  1414 |   412 |  3928 |  904362 |     19 |  3870467 |  396227 |  401174 |  3000858 |  0.77 |  2.441 |
|   10 | 2 |  4 |   748 |    79 |  2067 |  841691 |     19 |  3904289 |  388012 |  384675 |  3084400 |  0.79 |   2.49 |
|   10 | 2 |  8 |   622 |    16 |  1582 |  684099 |     19 |  3572951 |  322349 |  308666 |  2906959 |  0.81 |  2.296 |
|   10 | 2 | 16 |   626 |    18 |  1525 |  702968 |     19 |  4128273 |  329265 |  307533 |  3449932 |  0.83 |  2.564 |
|   10 | 2 | 32 |   598 |     4 |  1351 |  649083 |     19 |  4726453 |  308440 |  287377 |  4096812 |  0.86 |   3.04 |
|   10 | 2 | 64 |   592 |     1 |  1245 | 1191755 |     19 | 14284034 |  631575 |  517496 | 13109388 |  0.92 |  9.941 |
|   10 | 3 |  1 |  6216 |  2813 |  6808 |   25156 |     19 |        0 |       0 |       0 |        0 |  0.00 |  0.245 |
|   10 | 3 |  2 |  1474 |   442 |  2981 |  511040 |     19 |  2269461 |  206824 |  248746 |  1781383 |  0.78 |  1.515 |
|   10 | 3 |  4 |   708 |    59 |  1821 |  543679 |     19 |  2553899 |  231224 |  263186 |  2028380 |  0.79 |  1.711 |
|   10 | 3 |  8 |   626 |    18 |  1556 |  585870 |     19 |  3049927 |  263995 |  275135 |  2482498 |  0.81 |  1.991 |
|   10 | 3 | 16 |   604 |     7 |  1438 |  704196 |     19 |  4274064 |  334914 |  320626 |  3590381 |  0.84 |  2.613 |
|   10 | 3 | 32 |   596 |     3 |  1331 |  626442 |     19 |  4741981 |  297431 |  283730 |  4133491 |  0.87 |   3.14 |
|   10 | 3 | 64 |   594 |     2 |  1243 |  633535 |     19 |  7342473 |  308687 |  286050 |  6726353 |  0.91 |  4.923 |
|   11 | 0 |  1 | 48612 | 23659 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.701 |
|   11 | 0 |  2 | 48612 | 23659 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.697 |
|   11 | 0 |  4 | 48612 | 23659 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.693 |
|   11 | 0 |  8 | 48612 | 23659 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.698 |
|   11 | 0 | 16 | 48612 | 23659 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.686 |
|   11 | 0 | 32 | 48612 | 23659 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.692 |
|   11 | 0 | 64 | 48612 | 23659 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.699 |
|   11 | 1 |  1 | 21418 | 10062 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.406 |
|   11 | 1 |  2 | 21418 | 10062 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.402 |
|   11 | 1 |  4 | 21418 | 10062 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.401 |
|   11 | 1 |  8 | 21418 | 10062 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.401 |
|   11 | 1 | 16 | 21418 | 10062 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.402 |
|   11 | 1 | 32 | 21418 | 10062 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.403 |
|   11 | 1 | 64 | 21418 | 10062 |     0 |       0 |      0 |        0 |       0 |       0 |        0 |  0.00 |  0.396 |
|   11 | 2 |  1 | 21716 | 10211 | 55433 |  411948 |     21 |        0 |       0 |       0 |        0 |  0.00 |  1.112 |
|   11 | 2 |  2 |  3606 |  1156 |  9872 | 4914839 |     21 | 23466064 | 2389830 | 2219974 | 18642727 |  0.79 | 15.164 |
|   11 | 2 |  4 |  1628 |   167 |  4703 | 4064039 |     21 | 20733882 | 2020233 | 1863324 | 16724906 |  0.80 | 13.588 |
|   11 | 2 |  8 |  1384 |    45 |  3678 | 3473925 |     21 | 19194516 | 1827924 | 1566716 | 15769772 |  0.82 | 13.292 |
|   11 | 2 | 16 |  1320 |    13 |  3138 | 3569411 |     21 | 23407683 | 1877035 | 1564976 | 19887126 |  0.85 | 15.372 |
|   11 | 2 | 32 |  1336 |    21 |  3041 | 3398865 |     21 | 26518507 | 1758406 | 1475798 | 23174797 |  0.87 | 17.388 |
|   11 | 2 | 64 |  1304 |     5 |  2772 | 3218082 |     21 | 35451197 | 1683766 | 1404590 | 32278765 |  0.91 | 24.111 |
|   11 | 3 |  1 | 21418 | 10062 | 22714 |   87547 |     21 |        0 |       0 |       0 |        0 |  0.00 |  0.885 |
|   11 | 3 |  2 |  3588 |  1147 |  7323 | 2799400 |     21 | 13841653 | 1251244 | 1385299 | 11102850 |  0.80 |  8.873 |
|   11 | 3 |  4 |  1578 |   142 |  4128 | 2748133 |     21 | 14362999 | 1276787 | 1335353 | 11660353 |  0.81 |  9.587 |
|   11 | 3 |  8 |  1366 |    36 |  3524 | 2786729 |     21 | 15642373 | 1361992 | 1295436 | 12901772 |  0.82 | 10.207 |
|   11 | 3 | 16 |  1324 |    15 |  3116 | 3451088 |     21 | 23064348 | 1774923 | 1576987 | 19660390 |  0.85 | 14.721 |
|   11 | 3 | 32 |  1328 |    17 |  2968 | 3302551 |     21 | 26070100 | 1693648 | 1479676 | 22819319 |  0.87 | 16.837 |
|   11 | 3 | 64 |  1316 |    11 |  2786 | 3066707 |     21 | 33898712 | 1587278 | 1357278 | 30879272 |  0.91 | 22.999 |
#+TBLFM: $13=$12/($12+$7);%0.2f

** ~workForce~
#+BEGIN_SRC emacs-lisp :exports results :results table
  (org-table-import (expand-file-name "/tmp/saved.csv") nil)
#+END_SRC
| m |  w | nodes | fails | iter |    nbCS | layers | splitCS | pruneCS |    pot | hitCS |   time |
|---+----+-------+-------+------+---------+--------+---------+---------+--------+-------+--------|
| 0 |  1 |   560 |   281 |  908 |    9072 |    100 |       0 |       0 |      0 |     0 |  0.695 |
| 0 |  2 |   560 |   281 | 1053 |  189433 |    100 |  162390 |      20 |   3413 |     0 |  3.018 |
| 0 |  4 |   560 |   281 | 1155 |  378830 |    100 |  321363 |     420 |  10247 |     6 |   5.68 |
| 0 |  8 |   560 |   281 | 1299 |  861275 |    100 |  705602 |    3401 |  26845 |   157 | 12.112 |
| 0 | 16 |   560 |   281 | 1289 | 1709268 |    100 | 1398911 |    4406 |  50562 |  1735 | 26.413 |
| 0 | 32 |   560 |   281 | 1378 | 3624502 |    100 | 2981456 |   14975 | 109276 |  9540 |  69.52 |
